Backend/app/controllers/users_controller.rb

INSERT INTO "users" ("login_id", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        tags = params[:tags]
        tags = Parsing::ParamsParser.parse(tags)
        result = DBAdapter.create_model(:user, tags)

UPDATE "users" SET "login_id" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["login_id", "newstuff"], ["email", nil], ["updated_at", "2016-11-20 17:09:35.676981"], ["id", 2]]
---
    def update
        tags = params[:tags]
        tags = Parsing::ParamsParser.parse(tags)
        result = DBAdapter.update_model(:user, params[:id], tags)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def delete
        result = DBAdapter.delete_model(:user, params[:id])